const help = (ll, p, hr, pushname, prema, checATM, useLevel, useXp, requireXp, patt, bateria, porcentagem, chatss, me, reqcmd, _registered) => {
 return `
▛▄▄▄▄▄▄▄▄▄▄▄▄▄
▙▄▄▄▄▄▄▄▄▄▄▄▄▄
▛▌${ll}⇨ Prefixo:『${p}』${ll}
▌▌${ll}⇨ Hora: ${hr}${ll}
▌▌${ll}⇨ Total chat: *${chatss}*${ll}
▌▌${ll}⇨ Verificados: *${_registered.length}*${ll}
▌▌${ll}⇨ Bateria: ${bateria}${ll}
▌▌${ll}⇨ Nombre: ${me.name}${ll}
▌▌${ll}⇨ Usados: ${reqcmd}${ll}
▌▙▄▄▄▄▄▄▄▄▄▄▄▄▄
▙▄▄▄▄▄▄▄▄▄▄▄▄▄▄
▛▌🍎🍎🍎🍎🍎🍎🍎🍎🍎🍎
▌▛▄▄▄▄▄▄▄▄▄▄▄▄▄
▌▌⚠︎ ︎Informacion de Perfil
▌▙▄▄▄▄▄▄ ❖ ▄▄▄▄▄▄
▌▛▄▄▄▄▄▄ ❖ ▄▄▄▄▄▄
▌▌${ll}⇨ Nombre: ${pushname}
▌▌${ll}⇨ Usuario: ${prema}
▌▌${ll}⇨ Coins: ${checATM}
▌▌${ll}⇨ Nivel: ${useLevel}
▌▌${ll}⇨ Xp: ${useXp}/${requireXp}
▌▌${ll}⇨ Rol: ${patt}                        
▌▙▄▄▄▄▄▄ ❖ ▄▄▄▄▄
▙▄▄▄▄▄▄▄▄▄▄▄▄▄▄
▛▌⇨TODOS LOS MENUS  ❖
▌▛▄▄▄▄▄▄▄▄▄▄▄▄▄
▌▌ _⚠︎Escriba *help para menu_
▌▙▄▄▄▄▄▄ ❖ ▄▄▄▄▄▄
▌▛ ${ll}⇨ ${p}Downloads ${ll}
▌▙▄▄▄▄▄▄ ❖ ▄▄▄▄▄▄
▌▛ ${ll}⇨ ${p}Grupo ${ll}
▌▙▄▄▄▄▄▄ ❖ ▄▄▄▄▄▄
▌▛ ${ll}⇨ ${p}Juegos ${ll}
▌▙▄▄▄▄▄▄ ❖ ▄▄▄▄▄▄
▌▛ ${ll}⇨ ${p}Owner ${ll}
▌▙▄▄▄▄▄▄ ❖ ▄▄▄▄▄▄
▌▛ ${ll}⇨ ${p}Informacion ${ll}
▌▙▄▄▄▄▄▄ ❖ ▄▄▄▄▄▄
▌▛ ${ll}⇨ ${p}Animes ${ll}
▌▙▄▄▄▄▄▄ ❖ ▄▄▄▄▄▄
▌▛ ${ll}⇨ ${p}Coins ${ll}
▌▙▄▄▄▄▄▄ ❖ ▄▄▄▄▄▄
▌▛ ${ll}⇨ ${p}Premiun ${ll}
▌▙▄▄▄▄▄▄ ❖ ▄▄▄▄▄▄
▌▛ ${ll}⇨ ${p}Macker ${ll}
▌▙▄▄▄▄▄▄ ❖ ▄▄▄▄▄▄
▙▄▄▄▄▄▄▄ ❖ ▄▄▄▄▄▄`
}
exports.help = help
